import {
  Image,
  ImageBackground,
  ScrollView,
  StatusBar,
  StyleSheet,
  Text,
  TouchableOpacity,
  View,
} from "react-native";
import React, { Component } from "react";
import { fonts, metrics } from "../themes";
import {
  heightPercentageToDP,
  widthPercentageToDP,
} from "react-native-responsive-screen";
import { moderateScale, scale, verticalScale } from "react-native-size-matters";

import LatestHeaderComponent from "../components/LatestHeader";

export default class AboutUsPage extends Component {
  constructor(props) {
    super(props);
  }

  render() {
    return (
      <ImageBackground
        source={require("../resources/images/bg1.png")}
        resizeMode="cover"
        style={{ flex: 1 }}
        resizeMode="cover"
      >
        <View style={{ marginTop: heightPercentageToDP(4) }}>
          <LatestHeaderComponent
            showLogo={true}
            showDrawer={true}
            onPressMenuButton={() => this.props.navigation.openDrawer()}
          />
        </View>
        <ScrollView contentContainerStyle={{ flexGrow: 1 }}>
          <View style={{ flex: 1 }}>
            <StatusBar backgroundColor="transparent" translucent />
            <View
              style={{
                flex: 1,
                justifyContent: "flex-end",
                alignItems: "center",
              }}
            >
              <View style={{}}>
                <Text
                  style={{
                    fontSize: verticalScale(30),
                    fontWeight: "bold",
                    color: "white",
                    marginTop: moderateScale(25),
                  }}
                >
                  دەربارە
                </Text>
              </View>
              <View style={{}}>
                <Text
                  style={{
                    fontWeight: "normal",
                    color: "white",
                    textAlign: "justify",
                    margin: moderateScale(15),
                  }}
                >
                  دیجیتاڵ میدیای ئێن ئاڕ تی دوانگەی سەرەکیی سەرجەم بەرھەمەکانی
                  دامەزراوەی میدیایی نالیایە کە مێژووەکەی دەگەڕێتەوە بۆ سەروەختی
                  نەبوونیی یان دەگمەنیی تۆڕێکی راگەیاندنی پیشەیی بەرپرسیار لە
                  ھەرێمی کوردستان و عێراقدا. لە ساڵی ٢٠١٠دا بەدروشمی "راستگۆیی،
                  ھاوسەنگی، بوێریی" دەستەیەک لە رۆژنامەنووسانی ناحزبیی سەربەخۆ
                  لە کارنامە و ئایدۆلۆژیایەکی دیارییکراو؛ بەئامانجی پڕکردنەوەی
                  ئەو بۆشاییە میدیاییە دەرکەوتن و کەوتنە کارکردن. سەرچاوەی
                  دارایی ئەم دامەزراوەیە لەلایەن کۆمپانیای وەبەرھێنانی نالیاوە
                  دابیندەکرێت بەمەبەستی گواستنەوەی زانیاریی و ھەواڵ و
                  رووماڵکردنی رووداوە جۆربەجۆرەکان بەشێوەیەکی پیشەیی ستاندارد.
                  بێجگە لە ئۆفیسە سەرەکییەکەی لە شاری سلێمانی؛ دامەزراوەی
                  میدیایی نالیا لە سەرجەم شارەکانی ھەرێمی کوردستان و بەشێک لە
                  پارێزگاکانی دیکەی عێراق ئۆفیسی ھەیە. ئەم دامەزراوەیە لەمانەی
                  خوارەوە پێکدێت: یەکەم: دیجیتاڵ میدیای ئێن ئاڕ تی؛ دوانگەیەکی
                  سەرەکیی ئەلیکترۆنییە لە شەش ماڵپەر و دوو ئەپڵیکەیشن پێکھاتووەو
                  بەزمانەکانی کوردی (سۆرانی، بادینی، لاتینی) و عەرەبیی و
                  ئینگلیزیی پەخشدەکات و لە ساڵی ٢٠١١دا دامەزراوە. دووەم: ئێن ئاڕ
                  تی یەک؛ کەناڵێکی ھەواڵیی سیاسییە و لە ساڵی ٢٠١٠دا دامەزراوە.
                  سێیەم: ئێن ئاڕ تی دوو؛ کەناڵێکی خۆشباریی (ترفیھیة) و لە ساڵی
                  ٢٠١٢دا دامەزراوە. چوارەم: نالیا ئێف ئێم؛ رادیۆیەکی گشتیی
                  تایبەت بە گۆرانیی و میوزیکە و لە ساڵی ٢٠١٠دا دامەزراوە.
                  پێنجەم: ئەکادیمیای میدیایی نالیا؛ نێوەندێکی پەروەردەیی تایبەت
                  بە راھێنان و پێگەیاندنی کادری راگەیاندن و رۆژنامەوانییە و لە
                  ساڵی ٢٠١٥دا دامەزراوە. شەشەم: پام میدیا؛ کۆمپانیایەکی
                  بەرھەمھێنان و دابەشکردنی ریکلامی بازرگانیییە و لەساڵی ٢٠١٤دا
                  دامەزراوە. حەوتەم: ئێن ئاڕ تی عەرەبی؛ وەک کەناڵێکی ھەواڵیی
                  سیاسیی بە زمانی عەرەبیی لە ساڵی ٢٠١٦دا دامەزرا، بەڵام بەھۆی
                  قەیرانی داراییەوە لە ناوەڕاستی ساڵی ٢٠١٨دا لە پەخشکردن وەستا.
                  فریکوێنسەکانى ئێن ئاڕ تی یەک، ئێن ئاڕ تی دوو، نالیا ئێف ئێم:
                  ١٠٩٧١ بە ٢٧٥٠٠دیجیتاڵ میدیای ئێن ئاڕ تی دوانگەی سەرەکیی سەرجەم
                  بەرھەمەکانی دامەزراوەی میدیایی نالیایە کە مێژووەکەی دەگەڕێتەوە
                  بۆ سەروەختی نەبوونیی یان دەگمەنیی تۆڕێکی راگەیاندنی پیشەیی
                  بەرپرسیار لە ھەرێمی کوردستان و عێراقدا. لە ساڵی ٢٠١٠دا
                  بەدروشمی "راستگۆیی، ھاوسەنگی، بوێریی" دەستەیەک لە
                  رۆژنامەنووسانی ناحزبیی سەربەخۆ لە کارنامە و ئایدۆلۆژیایەکی
                  دیارییکراو؛ بەئامانجی پڕکردنەوەی ئەو بۆشاییە میدیاییە دەرکەوتن
                  و کەوتنە کارکردن. سەرچاوەی دارایی ئەم دامەزراوەیە لەلایەن
                  کۆمپانیای وەبەرھێنانی نالیاوە دابیندەکرێت بەمەبەستی گواستنەوەی
                  زانیاریی و ھەواڵ و رووماڵکردنی رووداوە جۆربەجۆرەکان بەشێوەیەکی
                  پیشەیی ستاندارد. بێجگە لە ئۆفیسە سەرەکییەکەی لە شاری سلێمانی؛
                  دامەزراوەی میدیایی نالیا لە سەرجەم شارەکانی ھەرێمی کوردستان و
                  بەشێک لە پارێزگاکانی دیکەی عێراق ئۆفیسی ھەیە. ئەم دامەزراوەیە
                  لەمانەی خوارەوە پێکدێت: یەکەم: دیجیتاڵ میدیای ئێن ئاڕ تی؛
                  دوانگەیەکی سەرەکیی ئەلیکترۆنییە لە شەش ماڵپەر و دوو ئەپڵیکەیشن
                  پێکھاتووەو بەزمانەکانی کوردی (سۆرانی، بادینی، لاتینی) و
                  عەرەبیی و ئینگلیزیی پەخشدەکات و لە ساڵی ٢٠١١دا دامەزراوە.
                  دووەم: ئێن ئاڕ تی یەک؛ کەناڵێکی ھەواڵیی سیاسییە و لە ساڵی
                  ٢٠١٠دا دامەزراوە. سێیەم: ئێن ئاڕ تی دوو؛ کەناڵێکی خۆشباریی
                  (ترفیھیة) و لە ساڵی ٢٠١٢دا دامەزراوە. چوارەم: نالیا ئێف ئێم؛
                  رادیۆیەکی گشتیی تایبەت بە گۆرانیی و میوزیکە و لە ساڵی ٢٠١٠دا
                  دامەزراوە. پێنجەم: ئەکادیمیای میدیایی نالیا؛ نێوەندێکی
                  پەروەردەیی تایبەت بە راھێنان و پێگەیاندنی کادری راگەیاندن و
                  رۆژنامەوانییە و لە ساڵی ٢٠١٥دا دامەزراوە. شەشەم: پام میدیا؛
                  کۆمپانیایەکی بەرھەمھێنان و دابەشکردنی ریکلامی بازرگانیییە و
                  لەساڵی ٢٠١٤دا دامەزراوە. حەوتەم: ئێن ئاڕ تی عەرەبی؛ وەک
                  کەناڵێکی ھەواڵیی سیاسیی بە زمانی عەرەبیی لە ساڵی ٢٠١٦دا
                  دامەزرا، بەڵام بەھۆی قەیرانی داراییەوە لە ناوەڕاستی ساڵی
                  ٢٠١٨دا لە پەخشکردن وەستا. فریکوێنسەکانى ئێن ئاڕ تی یەک، ئێن
                  ئاڕ تی دوو، نالیا ئێف ئێم: ١٠٩٧١ بە ٢٧٥٠٠
                </Text>
              </View>
            </View>
            <View style={{ justifyContent: "center", alignItems: "center" }}>
              <Image
                source={require("../resources/images/journalist.png")}
                style={{ height: 160, width: 180 }}
                resizeMode="contain"
              />
            </View>
          </View>
        </ScrollView>
      </ImageBackground>
    );
  }
}

const styles = StyleSheet.create({
  mainView: {
    flex: 1,
    justifyContent: "center",
    alignItems: "center",
  },
});
